blog/2020/2020-23.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2021-12-24 Fri 15:58 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>2020-23</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="/theme/normalize.css"/>
<link rel="stylesheet" href="/theme/site.css"/>
<link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Noto+Sans+SC&display=swap" rel="stylesheet">
</head>
<body>
<div id="content">
<header>
<h1 class="title">2020-23</h1>
</header><p>
6.1-6.7
</p>

<p>
这一周虽然没有尽数完成计划事项，但解决了很多棘手的问题。
</p>

<p>
已完成：
</p>

<ol class="org-ol">
<li>写作博客 5 篇(其中部分待完善)</li>
<li>解决由 http 和 https
之间相互转换而造成的重定向次数过多，进而使网页瘫痪问题</li>
<li>解决 VSCode 打开新文件覆盖旧文件问题</li>
<li>为网站添加友情链接</li>
<li>将博客部署至 Netlify</li>
<li>使用 hugo-notice 进行段落标记</li>
<li>在博客左下角添加微信公众号二维码，提供订阅博客渠道</li>
<li>搜集一些可以使用的 shortcodes</li>
<li>通过修改 hosts 文件加速访问 GitHub</li>
</ol>

<p>
未完成：
</p>

<ol class="org-ol">
<li>Emacs Tutorial 没有学习完</li>
<li>没有做《三十六惑》笔记</li>
<li>两本书的读书笔记搁置</li>
<li>没有学习 Python</li>
<li>没有学习专业课</li>
</ol>

<p>
第 24 周规划：
</p>

<ol class="org-ol">
<li>周一 -&#x2013;&#x2014; 把 Emacs Toturial 学习完，并总结成博客</li>
<li>周一 -&#x2013;&#x2014; 做信号习题，不会的看书</li>
<li>周一 -&#x2013;&#x2014;
预习周二要学的模电，弄清楚数电学到哪了，看看学到的地方的前后两个小节</li>
<li>周二 -&#x2013;&#x2014; 学习 Frontend Masters 的 Bootcamp 的部分</li>
<li>周二 -&#x2013;&#x2014; 复习模电、数电当天学习内容，预习概率</li>
<li>周三 -&#x2013;&#x2014; 学习 算法，做笔记</li>
<li>周三 -&#x2013;&#x2014; 继续学习 Frontend</li>
<li>周三 -&#x2013;&#x2014; 做概率作业</li>
<li>周三 -&#x2013;&#x2014; 复习 数电</li>
<li>周四 -&#x2013;&#x2014; 复习 周二和周三 学习的 Frontend 和算法</li>
<li>周四 -&#x2013;&#x2014; 复习+预习模电</li>
<li>周四 -&#x2013;&#x2014; 复习+预习信号</li>
<li>周五 -&#x2013;&#x2014; 看电影《海蒂和爷爷》</li>
<li>周六 -&#x2013;&#x2014; 复习周一至周五所学编程和专业课程</li>
<li>周日同周六</li>
</ol>

<p>
本周学习状况分析：
</p>

<ol class="org-ol">
<li>一开始的计划不够详细，新的一周开始时也没有制订更详细的计划。所以看似完成了那么多的问题，但是这些问题不成体系。我没有一个提纲挈领的东西，我面朝哪里，就解决哪里的问题，没有规划，不完全，心里不踏实。</li>

<li>周二坐在电脑面前的时间最长，在解决有关网站的一些问题。处于解决问题的状态持续了很长时间，我逐渐急躁起来，在查找问题答案的过程中，我越来越不能沉住气，反过来它就影响我解决问题的效率。进而，产生自我怀疑。实际上，这只不过是过度疲劳所造成的后果。</li>

<li>我一直在念叨我的信号、模电、数电、概率这四门课程。我不能在心里想任何让我紧张的话，唯一能做的，就是制订计划+复习。</li>

<li><p>
这一周有一件比较高兴的事：我申请通过了 GitHub
对于在校学生的特殊照顾，可以免费升级至 pro
用户。另外，还有很多其他对于目前的我来说很有用的资源。具体的申请方法：
</p>

<p>
访问：<a href="https://education.github.com/discount_requests/new">https://education.github.com/discount_requests/new</a>,
选择“学生”，选一个邮箱，输入学校名称(英文的)，然后它会出现一个上传文件的地方，注意上传格式是
图片 还是
pdf。这个证明文件可以去学信网(<a href="https://my.chsi.com.cn/archive/index.jsp">https://my.chsi.com.cn/archive/index.jsp</a>)下载，先登录后找到“在线验证报告”，下载即可，最后填写使用
GitHub 的计划。
</p>

<p>
这个审核速度很快，我的是一天还是半天，我忘记了。总之，祝想申请这一优惠的你成功吧。
</p></li>
</ol>
</div>
</body>
</html>